emacs-common/让Emacs为你自动插入内容(Emacs模板使用指南).org
#+TITLE: 让Emacs为你自动插入内容(Emacs模板使用指南)
#+URL: http://howardism.org/Technical/Emacs/templates-tutorial.html
#+AUTHOR: lujun9972
#+CATEGORY: emacs-common
#+DATE: [2016-10-12 周三 21:07]
#+OPTIONS: ^:{}

我们经常要打字. 而对于文本文件来说,很多的输出只是为了组织内容而已. 比如org-mode中的星号,空格以及 =#+=, 比如编程代码中的那些括号, =do..end= 之类的.

不过也没谁规定这些内容必须是由你手工输入的呀.

下面介绍几种让Emacs为你自动输入的几种方法… 比如我们可以在新建某类文件时自动插入一份样板文.

注意,在本教材中,我不会将关于自动补全的内容,所以不会讲到 =auto-complete= 或 =company=.

* Introduction to YAS

[[https://github.com/capitaomorte/yasnippet][yasnippet]] 可以让你快速插入代码片段. 所谓片段是指一份模板,你可以手工或用程序来替换模板中的某些内容. 
至于会选择哪个模板来扩展则要看buffer的mode了.

刚开始的时候, 让我们先配置一下YAS让它插入一段固定的文本吧. 
我这里假设你安装了[[https://github.com/jwiegley/use-package][use-package]], 让我们先安装yasnippet然后为我们的模板设置一个独立的目录(接下来我这里会混用片段和模板这两种说法):

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :init
    (yas-global-mode 1)
    :config
    (add-to-list 'yas-snippet-dirs (locate-user-emacs-file "snippets")))
#+END_SRC

然后我们可以按下 =C-c C-n= 来创建一个模板了,如果记不住快捷键的话也没关系,输入 =M-x yas-new-snippet= 也行(而且如果你开启了类似IDO的插件,这个速度也不慢).

你应该会进入一个新的template buffer中了, 而且由于它还使用了YAS,你可以输入一个域的内容后,按下 =Tab= 键来跳转到下一个域的位置.
假设你输入的内容是这样的:

#+BEGIN_SRC snippet
  # -*- mode: snippet -*-
  # name: blah
  # key: blah
  # --
  Bling blargh-a bloo bloop!
#+END_SRC

按下 =C-c C-c= 来应用该模板. Emacs会询问你这个模板需要在哪个mode下使用. 基本上你只需要直接按下回车就行了.

如果你想保存下来这个模板,推荐你保存到 =~/.emacs.d/snippets= 目录下,这也是默认的保存地址.

现在,在相同mode的buffer中输入 =blah= 然后按下 =Tab=, =blah= 会被扩展为: =Bling blargh-a bloo bloop!=

YAS还提供了多种触发模板的方法,不过下一步让我们修改模板让它变得更有用一些吧.

* Interactive Snippets

将一个简短的内容扩充为一长段内容当然很有用,若能让模板扩展的结果能适应上下文环境那就更好了.
首先我们让模板的某些内容变得容易修改起来.

在某个编程语言的mode下打开一份代码文件,然后新建一个模板. 比如我要为JavaScript创建一份ifelse的代码片段:

#+BEGIN_SRC snippet
  # -*- mode: snippet -*-
  # name: ifelse
  # key: ife
  # --
  if ($1) {
    $0;
  }
  else {
  }
#+END_SRC

现在我在JavaScript mode下输入 =ife= 按下 =Tab= 就能扩展出一个 =if.. else= 模板了, 而且你会看到光标定位到了括号中间($1指定了光标位置), 我们可以直接输入条件了. 
按下 =Tab= 后会跳转到大括号之间,这样我iu可以直接输入符合条件的执行语句了(因为$0标示了域编辑结束的地方)

关于YAS,我还没讲完了,不过让我们先讲点其他的,这样我的下一个YAS例子才显得有意义.

* New Files

还记得公司突然要求在每个文件头部加上版权声明的那个时候吗? 我是不太清楚这样做有多大的法律效力啦,不过Emacs很早以前就自带了 [[https://www.emacswiki.org/emacs/AutoInsertMode][Auto Insert]] 功能了.
它可以为某种特定mode的新文件设置一个样板文件.

下面配置使用 =use-package= 来为你的新文件配置样板文件:

#+BEGIN_SRC emacs-lisp
  (use-package autoinsert
    :init
    ;; Don't want to be prompted before insertion:
    (setq auto-insert-query nil)

    (setq auto-insert-directory (locate-user-emacs-file "templates"))
    (add-hook 'find-file-hook 'auto-insert)
    (auto-insert-mode 1)

    :config
    (define-auto-insert "\\.html?$" "default-html.html"))
#+END_SRC

这样配置后,创建一个以 =.html= 为后缀的文件会插入 =~/.emacs.d/templates/default-html.html= 的内容. 
这个功能很不错,不过对于资深用户还不太够用.

