blog/2016/10/12/让emacs为你自动插入内容(emacs模板使用指南)/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>让Emacs为你自动插入内容(Emacs模板使用指南) - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <!-- <link rel="stylesheet" href="https://lujun9972.github.io/emacs-document/media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="https://lujun9972.github.io/emacs-document/media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="https://lujun9972.github.io/emacs-document/">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="https://lujun9972.github.io/emacs-document/years/">Years</a></li>
        <li><a href="https://lujun9972.github.io/emacs-document/authors/">Authors</a></li>
        <li><a href="https://lujun9972.github.io/emacs-document/tags/">Tags</a></li>
        <li><a href="https://lujun9972.github.io/emacs-document/about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="https://lujun9972.github.io/emacs-document/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">让Emacs为你自动插入内容(Emacs模板使用指南)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c13924">1. Introduction to YAS</a></li>
<li><a href="#org1e5dbd4">2. Interactive Snippets</a></li>
<li><a href="#org394287e">3. New Files</a></li>
<li><a href="#org9fd58f9">4. Combining YAS and Auto Insert</a></li>
<li><a href="#org1b2f9cf">5. Programmatic Snippets</a></li>
<li><a href="#orge0a1bc2">6. Full Programmatic Inserts</a></li>
</ul>
</div>
</div>
<p>
我们经常要打字. 而对于文本文件来说,很多的输出只是为了组织内容而已. 比如org-mode中的星号,空格以及 <code>#+</code>, 比如编程代码中的那些括号, <code>do..end</code> 之类的.
</p>

<p>
不过也没谁规定这些内容必须是由你手工输入的呀.
</p>

<p>
下面介绍几种让Emacs为你自动输入的几种方法… 比如我们可以在新建某类文件时自动插入一份样板文.
</p>

<p>
注意,在本教材中,我不会将关于自动补全的内容,所以不会讲到 <code>auto-complete</code> 或 <code>company</code>.
</p>

<div id="outline-container-org7c13924" class="outline-2">
<h2 id="org7c13924"><span class="section-number-2">1</span> Introduction to YAS</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/capitaomorte/yasnippet">yasnippet</a> 可以让你快速插入代码片段. 所谓片段是指一份模板,你可以手工或用程序来替换模板中的某些内容. 
至于会选择哪个模板来扩展则要看buffer的mode了.
</p>

<p>
刚开始的时候, 让我们先配置一下YAS让它插入一段固定的文本吧. 
我这里假设你安装了<a href="https://github.com/jwiegley/use-package">use-package</a>, 让我们先安装yasnippet然后为我们的模板设置一个独立的目录(接下来我这里会混用片段和模板这两种说法):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">use-package</span> <span style="color: #a45bad;">yasnippet</span>
  <span style="color: #4f97d7;">:ensure</span> t
  <span style="color: #4f97d7;">:init</span>
  <span style="color: #bc6ec5;">(</span>yas-global-mode <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7;">:config</span>
  <span style="color: #bc6ec5;">(</span>add-to-list 'yas-snippet-dirs <span style="color: #2d9574;">(</span>locate-user-emacs-file <span style="color: #2d9574;">"snippets"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
然后我们可以按下 <code>C-c C-n</code> 来创建一个模板了,如果记不住快捷键的话也没关系,输入 <code>M-x yas-new-snippet</code> 也行(而且如果你开启了类似IDO的插件,这个速度也不慢).
</p>

<p>
你应该会进入一个新的template buffer中了, 而且由于它还使用了YAS,你可以输入一个域的内容后,按下 <code>Tab</code> 键来跳转到下一个域的位置.
假设你输入的内容是这样的:
</p>

<div class="org-src-container">
<pre class="src src-snippet"><span style="color: #2aa1ae; background-color: #292e34;"># -*- mode: snippet -*-</span>
<span style="color: #2aa1ae; background-color: #292e34;"># name: blah</span>
<span style="color: #2aa1ae; background-color: #292e34;"># key: blah</span>
<span style="color: #2aa1ae; background-color: #292e34;"># --</span>
Bling blargh-a bloo bloop!
</pre>
</div>

<p>
按下 <code>C-c C-c</code> 来应用该模板. Emacs会询问你这个模板需要在哪个mode下使用. 基本上你只需要直接按下回车就行了.
</p>

<p>
如果你想保存下来这个模板,推荐你保存到 <code>~/.emacs.d/snippets</code> 目录下,这也是默认的保存地址.
</p>

<p>
现在,在相同mode的buffer中输入 <code>blah</code> 然后按下 <code>Tab</code>, <code>blah</code> 会被扩展为: <code>Bling blargh-a bloo bloop!</code>
</p>

<p>
YAS还提供了多种触发模板的方法,不过下一步让我们修改模板让它变得更有用一些吧.
</p>
</div>
</div>

<div id="outline-container-org1e5dbd4" class="outline-2">
<h2 id="org1e5dbd4"><span class="section-number-2">2</span> Interactive Snippets</h2>
<div class="outline-text-2" id="text-2">
<p>
将一个简短的内容扩充为一长段内容当然很有用,若能让模板扩展的结果能适应上下文环境那就更好了.
首先我们让模板的某些内容变得容易修改起来.
</p>

<p>
在某个编程语言的mode下打开一份代码文件,然后新建一个模板. 比如我要为JavaScript创建一份ifelse的代码片段:
</p>

<div class="org-src-container">
<pre class="src src-snippet"><span style="color: #2aa1ae; background-color: #292e34;"># -*- mode: snippet -*-</span>
<span style="color: #2aa1ae; background-color: #292e34;"># name: ifelse</span>
<span style="color: #2aa1ae; background-color: #292e34;"># key: ife</span>
<span style="color: #2aa1ae; background-color: #292e34;"># --</span>
if <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">$</span><span style="color: #2d9574;">1</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">$</span><span style="color: #2d9574;">0</span>;
<span style="color: #4f97d7; font-weight: bold;">}</span>
<span style="color: #dc752f; background-color: #292b2e;">else </span><span style="color: #4f97d7; background-color: #292b2e;">{</span>
<span style="color: #4f97d7; font-weight: bold;">}</span>
</pre>
</div>

<p>
现在我在JavaScript mode下输入 <code>ife</code> 按下 <code>Tab</code> 就能扩展出一个 <code>if.. else</code> 模板了, 而且你会看到光标定位到了括号中间($1指定了光标位置), 我们可以直接输入条件了. 
按下 <code>Tab</code> 后会跳转到大括号之间,这样我iu可以直接输入符合条件的执行语句了(因为$0标示了域编辑结束的地方)
</p>

<p>
关于YAS,我还没讲完了,不过让我们先讲点其他的,这样我的下一个YAS例子才显得有意义.
</p>
</div>
</div>

<div id="outline-container-org394287e" class="outline-2">
<h2 id="org394287e"><span class="section-number-2">3</span> New Files</h2>
<div class="outline-text-2" id="text-3">
<p>
还记得公司突然要求在每个文件头部加上版权声明的那个时候吗? 我是不太清楚这样做有多大的法律效力啦,不过Emacs很早以前就自带了 <a href="https://www.emacswiki.org/emacs/AutoInsertMode">Auto Insert</a> 功能了.
它可以为某种特定mode的新文件设置一个样板文件.
</p>

<p>
下面配置使用 <code>use-package</code> 来为你的新文件配置样板文件:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">use-package</span> <span style="color: #a45bad;">autoinsert</span>
  <span style="color: #4f97d7;">:init</span>
  <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Don't want to be prompted before insertion:</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> auto-insert-query nil<span style="color: #bc6ec5;">)</span>

  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> auto-insert-directory <span style="color: #2d9574;">(</span>locate-user-emacs-file <span style="color: #2d9574;">"templates"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>add-hook 'find-file-hook 'auto-insert<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>auto-insert-mode <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>

  <span style="color: #4f97d7;">:config</span>
  <span style="color: #bc6ec5;">(</span>define-auto-insert <span style="color: #2d9574;">"\\.html?$"</span> <span style="color: #2d9574;">"default-html.html"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
这样配置后,创建一个以 <code>.html</code> 为后缀的文件会插入 <code>~/.emacs.d/templates/default-html.html</code> 的内容. 
这个功能很不错,不过对于资深用户还不太够用.
</p>
</div>
</div>
