emacs-common/让Emacs为你自动插入内容(Emacs模板使用指南).org
* Combining YAS and Auto Insert

我们可以用一个模板作为新文件的默认内容, 这样我们还可以对插入的样板作一些修改.

YAS实际上使用 =yas-expand-snippet= 来完成扩展动作的, 这个函数接受一个参数,那就是要插入模板的内容. 你可以将下面代码放入 =*scratch*= buffer中,然后执行这条语句试试(用C-x C-e)来执行:

#+BEGIN_SRC emacs-lisp
(yas-expand-snippet ";; Bah-da $1 Bing")  
#+END_SRC

你大概能够猜到我下一步要干嘛了对吧? 让我们来创建一个辅组函数,这个辅组函数将auto-insert自动插入新文件的内容作为模板来进行扩展.

#+BEGIN_SRC emacs-lisp
  (defun autoinsert-yas-expand()
    "Replace text in yasnippet template."
    (yas-expand-snippet (buffer-string) (point-min) (point-max)))
#+END_SRC

上面 =(buffer-string)= 会返回buffer的整个内容, 而yas-expand-snippet接受的额外两个参数指明了用结果替代当前buffer的哪些内容. 在上例中的 =(point-min)= 和 =(point-max)= 表示替换整个buffer的内容.

=define-auto-insert= 函数能够接受一个数组为参数,数组中的元素若为字符串,则表示引入相应文件的内容,若元素为一个函数名称,则表示执行该函数:.

#+BEGIN_SRC emacs-lisp
  (define-auto-insert "\\.el$" [ "defaults-elisp.el" autoinsert-yas-expand ])
#+END_SRC

上面的设置表示,当新建一个以 =.el= 为后缀的文件时,先插入 =defaults-elisp.el= 文件中的内容,然后执行函数 =autoinsert-yas-expand=,这个函数会扩展该模板并替代原模板的内容.

你甚至还可以在模板中添加 =$1= , =$2= 这样的域占位符.

我是用use-package来封装这些模板的,像这样:

#+BEGIN_SRC emacs-lisp
  (use-package autoinsert
    :config
    (define-auto-insert "\\.el$" ["default-lisp.el" ha/autoinsert-yas-expand])
    (define-auto-insert "\\.sh$" ["default-sh.sh" ha/autoinsert-yas-expand])
    (define-auto-insert "/bin/"  ["default-sh.sh" ha/autoinsert-yas-expand])
    (define-auto-insert "\\.html?$" ["default-html.html" ha/autoinsert-yas-expand]))
#+END_SRC

* Programmatic Snippets

手工输入域的内容当然可以,不过若是能用程序自动输入某些信息不是更好吗?

比如, 一般来说,我们的Emacs Lisp文件头部都是这样的:

#+BEGIN_SRC emacs-lisp
  ;;; demo-it --- Utility functions for creating demonstrations
  ;;
  ;; Copyright (C) 2014  Howard Abrams
  ;;
  ;; Author: Howard Abrams [[mailto:howard.abrams%2540gmail.com][<howard.abrams@gmail.com>]]
  ;; Keywords: demonstration presentation
  ;;
  ;; This program is free software; you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; ...
#+END_SRC

这里第一行包含了文件的名称及其描述. YAS会将反引号中的代码作为Emacs Lisp来执行,因此执行:

#+BEGIN_SRC emacs-lisp
(yas-expand-snippet "`(buffer-file-name)`")  
#+END_SRC

会插入buffer所示文件名的完整路径, 而执行:

#+BEGIN_SRC emacs-lisp
(yas-expand-snippet "`user-full-name`")  
#+END_SRC

会插入变量 =user-file-name= 的值. 

我们的Emacs Lisp模板可以设置成这样:

#+BEGIN_SRC emacs-lisp
  ;;; `(upcase (file-name-nondirectory (file-name-sans-extension (buffer-file-name))))` --- $1
  ;;
  ;; Author: `user-full-name` <`user-mail-address`>
  ;; Copyright © `(format-time-string "%Y")`, `user-full-name`, all rights reserved.
  ;; Created: `(format-time-string "%e %B %Y")`
  ;;
  ;;; Commentary:
  ;;
  ;;  $2
  ;;
  ;;; Code:

  $0

  ;;; `(file-name-nondirectory (buffer-file-name))` ends here
#+END_SRC

