blog/2016/10/12/让emacs为你自动插入内容(emacs模板使用指南)/index.html

<div id="outline-container-org9fd58f9" class="outline-2">
<h2 id="org9fd58f9"><span class="section-number-2">4</span> Combining YAS and Auto Insert</h2>
<div class="outline-text-2" id="text-4">
<p>
我们可以用一个模板作为新文件的默认内容, 这样我们还可以对插入的样板作一些修改.
</p>

<p>
YAS实际上使用 <code>yas-expand-snippet</code> 来完成扩展动作的, 这个函数接受一个参数,那就是要插入模板的内容. 你可以将下面代码放入 <code>*scratch*</code> buffer中,然后执行这条语句试试(用C-x C-e)来执行:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>yas-expand-snippet <span style="color: #2d9574;">";; Bah-da $1 Bing"</span><span style="color: #4f97d7;">)</span>  
</pre>
</div>

<p>
你大概能够猜到我下一步要干嘛了对吧? 让我们来创建一个辅组函数,这个辅组函数将auto-insert自动插入新文件的内容作为模板来进行扩展.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">autoinsert-yas-expand</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #2aa1ae;">"Replace text in yasnippet template."</span>
  <span style="color: #bc6ec5;">(</span>yas-expand-snippet <span style="color: #2d9574;">(</span>buffer-string<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>point-min<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>point-max<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
上面 <code>(buffer-string)</code> 会返回buffer的整个内容, 而yas-expand-snippet接受的额外两个参数指明了用结果替代当前buffer的哪些内容. 在上例中的 <code>(point-min)</code> 和 <code>(point-max)</code> 表示替换整个buffer的内容.
</p>

<p>
<code>define-auto-insert</code> 函数能够接受一个数组为参数,数组中的元素若为字符串,则表示引入相应文件的内容,若元素为一个函数名称,则表示执行该函数:.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>define-auto-insert <span style="color: #2d9574;">"\\.el$"</span> <span style="color: #bc6ec5;">[</span> <span style="color: #2d9574;">"defaults-elisp.el"</span> autoinsert-yas-expand <span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
上面的设置表示,当新建一个以 <code>.el</code> 为后缀的文件时,先插入 <code>defaults-elisp.el</code> 文件中的内容,然后执行函数 <code>autoinsert-yas-expand</code>,这个函数会扩展该模板并替代原模板的内容.
</p>

<p>
你甚至还可以在模板中添加 <code>$1</code> , <code>$2</code> 这样的域占位符.
</p>

<p>
我是用use-package来封装这些模板的,像这样:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">use-package</span> <span style="color: #a45bad;">autoinsert</span>
  <span style="color: #4f97d7;">:config</span>
  <span style="color: #bc6ec5;">(</span>define-auto-insert <span style="color: #2d9574;">"\\.el$"</span> <span style="color: #2d9574;">[</span><span style="color: #2d9574;">"default-lisp.el"</span> ha/autoinsert-yas-expand<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>define-auto-insert <span style="color: #2d9574;">"\\.sh$"</span> <span style="color: #2d9574;">[</span><span style="color: #2d9574;">"default-sh.sh"</span> ha/autoinsert-yas-expand<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>define-auto-insert <span style="color: #2d9574;">"/bin/"</span>  <span style="color: #2d9574;">[</span><span style="color: #2d9574;">"default-sh.sh"</span> ha/autoinsert-yas-expand<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>define-auto-insert <span style="color: #2d9574;">"\\.html?$"</span> <span style="color: #2d9574;">[</span><span style="color: #2d9574;">"default-html.html"</span> ha/autoinsert-yas-expand<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b2f9cf" class="outline-2">
<h2 id="org1b2f9cf"><span class="section-number-2">5</span> Programmatic Snippets</h2>
<div class="outline-text-2" id="text-5">
<p>
手工输入域的内容当然可以,不过若是能用程序自动输入某些信息不是更好吗?
</p>

<p>
比如, 一般来说,我们的Emacs Lisp文件头部都是这样的:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">demo-it --- Utility functions for creating demonstrations</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Copyright (C) 2014  Howard Abrams</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Author: Howard Abrams [[mailto:howard.abrams%2540gmail.com][<a href="mailto:howard.abrams%40gmail.com">&lt;howard.abrams@gmail.com&gt;</a>]]</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Keywords: demonstration presentation</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">This program is free software; you can redistribute it and/or modify</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">it under the terms of the GNU General Public License as published by</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">the Free Software Foundation, either version 3 of the License, or</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">...</span>
</pre>
</div>

<p>
这里第一行包含了文件的名称及其描述. YAS会将反引号中的代码作为Emacs Lisp来执行,因此执行:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>yas-expand-snippet <span style="color: #2d9574;">"`(buffer-file-name)`"</span><span style="color: #4f97d7;">)</span>  
</pre>
</div>

<p>
会插入buffer所示文件名的完整路径, 而执行:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>yas-expand-snippet <span style="color: #2d9574;">"`user-full-name`"</span><span style="color: #4f97d7;">)</span>  
</pre>
</div>

<p>
会插入变量 <code>user-file-name</code> 的值. 
</p>

<p>
我们的Emacs Lisp模板可以设置成这样:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">`(upcase (file-name-nondirectory (file-name-sans-extension (buffer-file-name))))` --- $1</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Author: `user-full-name` &lt;`user-mail-address`&gt;</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Copyright &#169; `(format-time-string "%Y")`, `user-full-name`, all rights reserved.</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Created: `(format-time-string "%e %B %Y")`</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">Commentary:</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">$2</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;</span>
<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">Code:</span>

$0

<span style="color: #2aa1ae; background-color: #292e34;">;;; </span><span style="color: #2aa1ae; background-color: #292e34;">`(file-name-nondirectory (buffer-file-name))` ends here</span>
</pre>
</div>
</div>
</div>
